&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ТабДок = Новый ТабличныйДокумент;
	ПечатьКоммерческогоПредложения(ТабДок, ПараметрКоманды);
	
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
КонецПроцедуры

&НаСервере
Процедура ПечатьКоммерческогоПредложения(ТабДок, ПараметрКоманды)
	Документы.ЗаказКлиента.ПечатьКоммерческогоПредложения(ТабДок, ПараметрКоманды);
КонецПроцедуры
