&НаКлиенте
Процедура СформироватьСписокМатериалов(Команда)
	СформироватьСписокМатериаловНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьСписокМатериаловНаСервере()
	// Очищаем список материалов
	Объект.СписокМатериалов.Очистить();

	// Выбираем списки материалов из услуг
	// Перемножаем количество
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СписокЭтапов.Номенклатура,
	|	СписокЭтапов.Количество,
	|	СписокЭтапов.НомерСтроки
	|ПОМЕСТИТЬ ВТ_СписокЭтапов
	|ИЗ
	|	&СписокЭтапов КАК СписокЭтапов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НоменклатураМатериалы.Номенклатура,
	|	НоменклатураМатериалы.Количество * ВТ_СписокЭтапов.Количество КАК Количество,
	|	ЦеныНоменклатурыСрезПоследних.Цена,
	|	ВТ_СписокЭтапов.НомерСтроки КАК НомерЭтапа
	|ИЗ
	|	ВТ_СписокЭтапов КАК ВТ_СписокЭтапов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.Материалы КАК НоменклатураМатериалы
	|		ПО ВТ_СписокЭтапов.Номенклатура = НоменклатураМатериалы.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Период,) КАК ЦеныНоменклатурыСрезПоследних
	|		ПО НоменклатураМатериалы.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_СписокЭтапов.НомерСтроки,
	|	НоменклатураМатериалы.НомерСтроки";

	Запрос.УстановитьПараметр("СписокЭтапов", Объект.СписокЭтапов.Выгрузить());
	Запрос.УстановитьПараметр("Период", ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДатаСеанса()));
	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.СписокМатериалов.Добавить();
		НоваяСтрока.НомерЭтапа = Выборка.НомерЭтапа;
		НоваяСтрока.Номенклатура = Выборка.Номенклатура;
		НоваяСтрока.Количество = Выборка.Количество;
		НоваяСтрока.Цена = Выборка.Цена;
		НоваяСтрока.Сумма = НоваяСтрока.Количество * НоваяСтрока.Цена;
	КонецЦикла;
КонецПроцедуры